#+TITLE: HM: Directed Graph Representation of Archaeology's Harris Matrix
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t author:t creator:nil date:nil timestamp:t todo:nil
#+OPTIONS: ^:nil
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.3beta)
#+SETUPFILE: /home/dk/.emacs.d/private/local/org-html-themes/setup/theme-readtheorg.setup
#+HTML: <meta http-equiv='Content-Type' content='text/html; charset=utf-8' />
** Use the =hm= name space

Move into the =hm= name space for easy access to =hm= functions.

#+name: in-package
#+header: :exports both :results value :wrap example
#+BEGIN_SRC lisp
(use-package :hm)
#+END_SRC

#+RESULTS: in-package
#+BEGIN_example
T
#+END_example
* Classifiers

This section provides definitions for the various classifiers used by the =hm=
software and shows how to save a classification to a comma-separated-value text
file. There are two kinds of classifiers: archaeological classifiers that
reflect observations and inferences made by an archaeologist familiar with the
stratigraphic situation represented by the sequence diagram; and graph
theoretical classifiers that take advantage of the DAG representation to deduce
structural relations that might prove useful to the archaeologist tasked with
interpreting the sequence diagram.

The =hm= software currently implements the following classifiers:

#+name: classifiers
#+header: :results output :exports both :wrap example
#+BEGIN_SRC lisp
(show-classifiers)
#+END_SRC

#+RESULTS: classifiers
#+BEGIN_example
units
levels
phases
periods
adjacent
distance
reachable
#+END_example

** Write a Classification to a File

In addition to creating graphical output, the =hm= software can write a
classification to a comma-separated-value file to communicate with other
software.  The name of the output file is specified in the configuration file;
this protocol insures that the user of an =hm= project created by someone else
can be certain of a CSV file's contents.

In the example below, the file names for =distance=, =reachable=, and =adjacent=
classifications are helpfully descriptive, while the name given the =phases=
classification is not too helpful.

#+BEGIN_EXAMPLE
[Output files]
sequence-dot = fig-12-polygon-1.dot
chronology-dot =
distance = fig-12-distance.csv
reachable = fig-12-reachable.csv
adjacent = fig-12-adjacent.csv
phases = foobar.csv
periods = fig-12-periods.csv
...
#+END_EXAMPLE

The following transcript writes the =periods= classifier for the
=:fig-12-polygon= example to the =fig-12-periods.csv= file.

#+name: write-classifier
#+header: :exports source
#+BEGIN_SRC lisp
(defvar *seq*)
(setq *seq* (run-project/example :fig-12-polygon))
(write-classifier :periods *seq*)
#+END_SRC

The file =fig-12-periods.csv= file looks like this:

#+name: show-csv-output
#+header: :exports both :wrap example
#+BEGIN_SRC sh
head ../examples/fig-12-chronology/fig-12-periods.csv
#+END_SRC

#+RESULTS: show-csv-output
#+BEGIN_example
| node | periods |
|    1 |       1 |
|    2 |       2 |
|    3 |       2 |
|    4 |       2 |
|    5 |       2 |
|    6 |       2 |
|    9 |       3 |
|   10 |       1 |
|   12 |       2 |
#+END_example


* Classifiable Graph Attributes

The =hm= software is able to apply each of the classifiers to each of the
17 classifiable graph attributes listed below. The attributes
vary by their visual saliency and by the number of states they are able to
express. Fill color, color, and shape (including the polygon attributes) are
most salient for nodes, followed by font color, pen width, and style. Color,
style, and arrowhead are most salient for edges, followed by font size,
font color, and pen width.

#+name: classifiable-attributes
#+header: :results output :exports both :wrap example
#+BEGIN_SRC lisp
(show-classifiable-attributes)
#+END_SRC

#+RESULTS: classifiable-attributes
#+BEGIN_example
edge-color-by
edge-style-by
node-color-by
node-shape-by
node-style-by
edge-fontsize-by
edge-penwidth-by
node-penwidth-by
edge-arrowhead-by
edge-fontcolor-by
node-fillcolor-by
node-fontcolor-by
node-polygon-skew-by
node-polygon-image-by
node-polygon-sides-by
node-polygon-distortion-by
node-polygon-orientation-by
#+END_example


*** Shapes
Node shapes can be set individually, or they can be assigned by =hm= based on
the value of a classifier.  The names of the shapes are taken from the [[https://graphviz.gitlab.io/_pages/doc/info/shapes.html][=dot= software]].

Here is an example of node shapes set individually in the configuration file.
#+BEGIN_EXAMPLE
[Graphviz sequence reachability node shapes]
origin = box
reachable = triangle
not-reachable = oval
#+END_EXAMPLE

In situations where it is not possible to specify node shapes individually, the
=hm= software uses a lookup table to map a classifier to a node shape.  The
lookup table can be displayed with the following function call.

#+name: show-node-shape
#+header: :exports both :results output :wrap example
#+BEGIN_SRC lisp
(show-map :node-shape)
#+END_SRC

#+RESULTS: show-node-shape
#+BEGIN_example
0 --> box
1 --> trapezium
2 --> ellipse
3 --> egg
4 --> triangle
5 --> diamond
6 --> oval
7 --> circle
8 --> house
9 --> pentagon
10 --> parallelogram
11 --> square
12 --> star
13 --> hexagon
14 --> septagon
15 --> octagon
16 --> doublecircle
17 --> doubleoctagon
18 --> tripleoctagon
19 --> invtriangle
20 --> invtrapezium
21 --> invhouse
22 --> Mdiamond
23 --> Msquare
24 --> Mcircle
25 --> lpromoter
26 --> larrow
27 --> underline
28 --> note
29 --> tab
30 --> folder
31 --> box3d
32 --> component
33 --> cds
34 --> signature
35 --> rpromoter
36 --> rarrow
#+END_example


*** Styles
Node styles can be set individually, or they can be assigned by =hm= based on
the value of a classifier.  The names of the styles are taken from the [[https://graphviz.gitlab.io/_pages/doc/info/attrs.html#k:style][=dot=
software]].  Note that some styles have to do with the node outline and others
have to do with the node fill.  It is possible to set an option to two values,
one to control the node outline and the other to control the node fill.

Here is an example of node styles set individually in the configuration file.
In each case, the first value controls the node outline and the second value
controls the node fill.

#+BEGIN_EXAMPLE
[Graphviz sequence reachability node styles]
origin = solid,filled
reachable = dashed,filled
not-reachable = dotted,filled
#+END_EXAMPLE

In situations where it is not possible to specify the node styles individually,
the =hm= software uses a lookup table to map a classifier to a node style.  The
lookup table can be displayed with the following function call.

#+name: show-node-style
#+header: :exports both :results output :wrap example
#+BEGIN_SRC lisp
(show-map :node-style)
#+END_SRC

#+RESULTS: show-node-style
#+BEGIN_example
0 --> solid
1 --> dashed
2 --> dotted
3 --> bold
4 --> rounded
5 --> diagonals
6 --> filled
7 --> striped
8 --> wedged
#+END_example

*** Styles

The edge styles recognized by the =hm= software can be shown with the following
function call.  In each case, the name used by =hm= matches the [[https://graphviz.gitlab.io/_pages/doc/info/attrs.html#k:style][name used by =dot=]].

#+name: show-arc-styles
#+header: :results output :exports both :wrap example
#+BEGIN_SRC lisp
(show-map :edge-style)
#+END_SRC

#+RESULTS: show-arc-styles
#+BEGIN_example
0 --> solid
1 --> dashed
2 --> dotted
3 --> bold
#+END_example

*** Arrowheads

The arrowhead styles recognized by the =hm= software can be shown with the
following function call.  In each case, the name used by =hm= matches the [[https://graphviz.gitlab.io/_pages/doc/info/arrows.html][name
used by =dot=]].

#+name: show-arrowheads
#+header: :results output :exports both :wrap example
#+BEGIN_SRC lisp
(show-map :arrow-shape)
#+END_SRC

#+RESULTS: show-arrowheads
#+BEGIN_example
0 --> none
1 --> box
2 --> lbox
3 --> rbox
4 --> obox
5 --> olbox
6 --> orbox
7 --> crow
8 --> lcrow
9 --> rcrow
10 --> diamond
11 --> ldiamond
12 --> rdiamond
13 --> odiamond
14 --> oldiamond
15 --> ordiamond
16 --> dot
17 --> odot
18 --> inv
19 --> linv
20 --> rinv
21 --> oinv
22 --> olinv
23 --> orinv
24 --> normal
25 --> lnormal
26 --> rnormal
27 --> onormal
28 --> olnormal
29 --> ornormal
30 --> tee
31 --> ltee
32 --> rtee
33 --> vee
34 --> lvee
35 --> rvee
36 --> curve
37 --> lcurve
38 --> rcurve
39 --> icurve
40 --> licurve
41 --> ricurve
#+END_example

* DONE The Configuration File
  CLOSED: [2018-03-18 Sun 16:12]

 The =hm= configuration file conforms to the [[https://en.wikipedia.org/wiki/INI_file][informal =.ini= file standard for
 configuration software]], which specifies a structure composed of sections,
 options, and values.

 Here are the sections in an =hm= configuration file listed in alphabetical order.

 #+name: configuration-sections
 #+header: :results output :exports both :wrap example
 #+BEGIN_SRC lisp
   (use-package :hm)
   (defparameter *seq* (run-project/example :roskams-h :draw-sequence nil))
   (format t "~%Sections:~%")
   (show-configuration-sections *seq*)
 #+END_SRC

 #+RESULTS: configuration-sections
 #+BEGIN_example
 Read one initialization file: /home/dk/quicklisp/local-projects/hm/examples/roskams-h/roskams-h.ini.
 Reading table from roskams-h-contexts.csv.
 Nodes added to the sequence graph.
 Reading table from roskams-h-observations.csv.
 Arcs added to the sequence graph.
 Chronology graph off.
 Creating units classification.
 Archaeological sequence configured.

 Sections:
 General configuration
 Graph analysis configuration
 Graphviz chronology edge attributes
 Graphviz chronology graph attributes
 Graphviz chronology node attributes
 Graphviz legend node attributes
 Graphviz sequence adjacent edge arrowhead
 Graphviz sequence adjacent edge colors
 Graphviz sequence adjacent edge fontcolor
 Graphviz sequence adjacent edge fontsize
 Graphviz sequence adjacent edge penwidths
 Graphviz sequence adjacent edge styles
 Graphviz sequence adjacent node colors
 Graphviz sequence adjacent node fillcolors
 Graphviz sequence adjacent node fontcolors
 Graphviz sequence adjacent node penwidths
 Graphviz sequence adjacent node polygon distortion
 Graphviz sequence adjacent node polygon image
 Graphviz sequence adjacent node polygon orientation
 Graphviz sequence adjacent node polygon sides
 Graphviz sequence adjacent node polygon skew
 Graphviz sequence adjacent node shapes
 Graphviz sequence adjacent node styles
 Graphviz sequence classification
 Graphviz sequence edge attributes
 Graphviz sequence edge color schemes
 Graphviz sequence edge font color schemes
 Graphviz sequence graph attributes
 Graphviz sequence node attributes
 Graphviz sequence node color schemes
 Graphviz sequence node fill color schemes
 Graphviz sequence node font color schemes
 Graphviz sequence reachability edge arrowhead
 Graphviz sequence reachability edge colors
 Graphviz sequence reachability edge fontcolors
 Graphviz sequence reachability edge fontsize
 Graphviz sequence reachability edge penwidths
 Graphviz sequence reachability edge styles
 Graphviz sequence reachability node colors
 Graphviz sequence reachability node fillcolors
 Graphviz sequence reachability node fontcolors
 Graphviz sequence reachability node penwidths
 Graphviz sequence reachability node polygon distortion
 Graphviz sequence reachability node polygon image
 Graphviz sequence reachability node polygon orientation
 Graphviz sequence reachability node polygon sides
 Graphviz sequence reachability node polygon skew
 Graphviz sequence reachability node shapes
 Graphviz sequence reachability node styles
 Graphviz sequence unit edge arrowhead
 Graphviz sequence unit edge color
 Graphviz sequence unit edge fontcolor
 Graphviz sequence unit edge fontsize
 Graphviz sequence unit edge penwidth
 Graphviz sequence unit edge style
 Graphviz sequence unit node color
 Graphviz sequence unit node fillcolor
 Graphviz sequence unit node fontcolor
 Graphviz sequence unit node penwidth
 Graphviz sequence unit node polygon distortion
 Graphviz sequence unit node polygon image
 Graphviz sequence unit node polygon orientation
 Graphviz sequence unit node polygon sides
 Graphviz sequence unit node polygon skew
 Graphviz sequence unit node shape
 Graphviz sequence unit node style
 Input file headers
 Input files
 Output file headers
 Output files
 #+END_example

Each section typically includes several options, as shown in the =General
configuration= section, below.  Here, you can see that string values, such as
=project-directory= are not quoted.  Boolean options recognize several pairs of
terms: =on/off=, =yes/no=, =true/false=, or =1/0=.

#+BEGIN_EXAMPLE
[General configuration]
chronology-graph-draw = off
project-directory = ~/quicklisp/local-projects/hm/examples/fig-12-chronology/
legend = off
assume-correlations = yes
fast-matrix = on
#+END_EXAMPLE

Another example, the =Graphviz sequence graph attributes=, below, illustrates
strings, integers, and real numbers. In this example, the =fontsize= and
=margin= options take a real number(s), and the =fontsize-subscript= is set to
an integer. Options left blank specify that the =dot= software should use a
default value.

#+BEGIN_EXAMPLE
[Graphviz sequence graph attributes]
colorscheme = x11
bgcolor = white
fontname = Helvetica
fontsize = 14.0
fontcolor = black
label = Harris Figure 12 (with periods)
labelloc = t
style = filled
size =
ratio =
page =
dpi =
margin = 0.5,0.5
fontsize-subscript = 10
splines = ortho
url = http://tsdye.github.io/harris-matrix/
#+END_EXAMPLE

** Periods
   :PROPERTIES:
   :CUSTOM_ID: periods
   :END:

 This table describes periods, which are groups of interfacial contexts
 believed to have been in use at the same time.

 - id :: a unique integer to identify the period (primary key)
 - label :: name of the period used in the legend
 - attribute :: zero-based integer scale for a
   [[http://www.graphviz.org/doc/info/colors.html#brewer][Brewer color]]
 - description :: optional field not used by =hm=

An example is the file =bldg-1-5-periods.csv=.

#+header: :exports results :results raw :wrap example
#+BEGIN_SRC sh
head ~/quicklisp/local-projects/hm/examples/bldg-1-5/bldg-1-5-periods.csv
#+END_SRC

#+RESULTS:
#+BEGIN_example
id,label,attribute,description
1,Building 1,5,
2,Outside,6,
3,Building 5,7,
#+END_example

** Events
   :PROPERTIES:
   :CUSTOM_ID: events
   :END:

 This table associates events and contexts and specifies the nature of
 the association using terms introduced to archaeology by Jeffrey S. Dean in an
 essay entitled "Independent dating in archaeological analysis" published in
 /Advances in Archaeological Method and Theory/ in 1978.

 - theta :: unique label (primary key)
 - context :: context identifier (foreign key)
 - lab :: dating laboratory identifier
 - association :: one of =disjunct=, =direct=, =disparate=

An example is the file =bldg-1-5-dates.csv=.  As this example shows, the =hm=
software does not care if you add extra columns to the table.  The software
works with columns by position, so do not be tempted to switch columns around.

#+header: :exports results :results raw :wrap example
#+BEGIN_SRC sh
head ~/quicklisp/local-projects/hm/examples/bldg-1-5/bldg-1-5-dates.csv
#+END_SRC

#+RESULTS:
#+BEGIN_example
theta,context,lab,association,original context
1,3810+,OxA-11046,disjunct,3810
8,1297+,OxA-11045,disjunct,3036
10,3030+,OxA-11044,disjunct,3030
5,2165+,PL-972424A,disjunct,2198
4,2165+,PL-980558A,disjunct,2181
2,2165+,OxA-11043,disjunct,2166
3,2165+,OxA-11042,disjunct,2165
28,1951+,OxA-16800,associated,1960
27,1940+,OxA-16799,associated,1959
#+END_example

**** Eric Schulte's filter for HTML small caps

#+name: es-small-caps
#+begin_src emacs-lisp
;;; "sc" links for the \sc{} latex command
(defun org-export-html-small-caps (string backend channel)
  (when (org-export-derived-backend-p backend 'html)
    (let ((rx "{\\\\sc ")
          (fmt "<span style=\"font-variant:small-caps;\">%s</span>"))
      (with-temp-buffer
        (insert string)
        (goto-char (point-min))
        (while (re-search-forward rx nil t)
          (let* ((start (match-beginning 0))
                 (end (progn (goto-char start)
                             (forward-sexp)
                             (point)))
                 (content (buffer-substring (+ start 5) (- end 1))))
            (delete-region start end)
            (goto-char start)
            (insert (format fmt content))))
        (buffer-string)))))

(add-to-list 'org-export-filter-final-output-functions
             'org-export-html-small-caps)

(defun org-export-latex-sc (tree backend info)
  "Handle sc: links for latex export."
  (org-element-map tree 'link
    (lambda (object)
      (when (equal (org-element-property :type object) "sc")
        (org-element-insert-before
         (cond
          ((org-export-derived-backend-p backend 'latex)
           (list 'latex-fragment
                 (list :value (format "\\textsc{%s}"
                                      (org-element-property :path object))
                       :post-blank (org-element-property
                                    :post-blank object))))
          ((org-export-derived-backend-p backend 'html)
           (list 'export-snippet
                 (list :back-end "html"
                       :value
                       (format "<span class=\"sc\">%s</span>"
                               (org-element-property :path object))
                       :post-blank
                       (org-element-property :post-blank object))))
          (:otherwise
           (error "unsupported backend for `org-export-latex-sc'")))
         object)
        (org-element-extract-element object))))
  tree)

(org-add-link-type "sc")

(add-hook 'org-export-filter-parse-tree-functions
          'org-export-latex-sc)

#+end_src

#+results: es-small-caps
| org-export-latex-sc |



* Setup for html project
#+BEGIN_SRC emacs-lisp
    (progn
      (when (boundp 'org-publish-project-alist)
        (setq org-publish-project-alist nil))
      (add-to-list 'org-publish-project-alist
                   '("hm-site"
                     :base-directory "/home/dk/quicklisp/local-projects/hm/doc/"
                     :base-extension "org"
                     :exclude "hm-clod.org"
                     :publishing-directory "/home/dk/Public/projects/936-harris-matrix/site/doc/"
                     :publishing-function org-html-publish-to-html
                     :section-numbers nil
                     :table-of-contents "yes"
                     :style "<link rel=\"stylesheet\"
           href=\"http://orgmode.org/org.css\"
           type=\"text/css\"/>"))
      (add-to-list 'org-publish-project-alist
                   '("hm-support"
                     :base-directory "/home/dk/quicklisp/local-projects/hm/examples/"
                     :base-extension "jpg\\|gif\\|png\\|pdf"
                     :publishing-directory "/home/dk/Public/projects/936-harris-matrix/site/examples/"
                     :publishing-function org-publish-attachment))
      (add-to-list 'org-publish-project-alist
                   '("hm-bldg-5"
                     :base-directory "/home/dk/quicklisp/local-projects/hm/examples/bldg-1-5"
                     :base-extension "jpg\\|gif\\|png\\|pdf"
                     :publishing-directory "/home/dk/Public/projects/936-harris-matrix/site/examples/bldg-1-5/"
                     :publishing-function org-publish-attachment))
      (add-to-list 'org-publish-project-alist
                   '("hm-fig-12"
                     :base-directory "/home/dk/quicklisp/local-projects/hm/examples/fig-12-chronology/"
                     :base-extension "jpg\\|gif\\|png\\|pdf"
                     :publishing-directory "/home/dk/Public/projects/936-harris-matrix/site/examples/fig-12-chronology/"
                     :publishing-function org-publish-attachment))
      (add-to-list 'org-publish-project-alist
                   '("hm-h-structure"
                     :base-directory "/home/dk/quicklisp/local-projects/hm/examples/h-structure/"
                     :base-extension "jpg\\|gif\\|png\\|pdf"
                     :publishing-directory "/home/dk/Public/projects/936-harris-matrix/site/examples/h-structure/"
                     :publishing-function org-publish-attachment))
      (add-to-list 'org-publish-project-alist
                   '("hm-roskams-h"
                     :base-directory "/home/dk/quicklisp/local-projects/hm/examples/roskams-h/"
                     :base-extension "jpg\\|gif\\|png\\|pdf"
                     :publishing-directory "/home/dk/Public/projects/936-harris-matrix/site/examples/roskams-h/"
                     :publishing-function org-publish-attachment))
      (add-to-list 'org-publish-project-alist
                   '("hm-roskams-jumps"
                     :base-directory "/home/dk/quicklisp/local-projects/hm/examples/roskams-jumps/"
                     :base-extension "jpg\\|gif\\|png\\|pdf"
                     :publishing-directory "/home/dk/Public/projects/936-harris-matrix/site/examples/roskams-jumps/"
                     :publishing-function org-publish-attachment))
      (add-to-list 'org-publish-project-alist
                   '("hm" :components ("hm-site" "hm-bldg-5" "hm-fig-12" "hm-h-structure" "hm-roskams-h" "hm-roskams-jumps"))))
#+END_SRC

#+RESULTS:
| hm               | :components     | (hm-site hm-bldg-5 hm-fig-12 hm-h-structure hm-roskams-h hm-roskams-jumps) |                 |      |          |             |                       |                                                      |                                                                             |                          |                        |     |                    |     |        |                        |
| hm-roskams-jumps | :base-directory | /home/dk/quicklisp/local-projects/hm/examples/roskams-jumps/               | :base-extension | jpg\ | gif\     | png\        | pdf                   | :publishing-directory                                | /home/dk/Public/projects/936-harris-matrix/site/examples/roskams-jumps/     | :publishing-function     | org-publish-attachment |     |                    |     |        |                        |
| hm-roskams-h     | :base-directory | /home/dk/quicklisp/local-projects/hm/examples/roskams-h/                   | :base-extension | jpg\ | gif\     | png\        | pdf                   | :publishing-directory                                | /home/dk/Public/projects/936-harris-matrix/site/examples/roskams-h/         | :publishing-function     | org-publish-attachment |     |                    |     |        |                        |
| hm-h-structure   | :base-directory | /home/dk/quicklisp/local-projects/hm/examples/h-structure/                 | :base-extension | jpg\ | gif\     | png\        | pdf                   | :publishing-directory                                | /home/dk/Public/projects/936-harris-matrix/site/examples/h-structure/       | :publishing-function     | org-publish-attachment |     |                    |     |        |                        |
| hm-fig-12        | :base-directory | /home/dk/quicklisp/local-projects/hm/examples/fig-12-chronology/           | :base-extension | jpg\ | gif\     | png\        | pdf                   | :publishing-directory                                | /home/dk/Public/projects/936-harris-matrix/site/examples/fig-12-chronology/ | :publishing-function     | org-publish-attachment |     |                    |     |        |                        |
| hm-bldg-5        | :base-directory | /home/dk/quicklisp/local-projects/hm/examples/bldg-1-5                     | :base-extension | jpg\ | gif\     | png\        | pdf                   | :publishing-directory                                | /home/dk/Public/projects/936-harris-matrix/site/examples/bldg-1-5/          | :publishing-function     | org-publish-attachment |     |                    |     |        |                        |
| hm-support       | :base-directory | /home/dk/quicklisp/local-projects/hm/examples/                             | :base-extension | jpg\ | gif\     | png\        | pdf                   | :publishing-directory                                | /home/dk/Public/projects/936-harris-matrix/site/examples/                   | :publishing-function     | org-publish-attachment |     |                    |     |        |                        |
| hm-site          | :base-directory | /home/dk/quicklisp/local-projects/hm/doc/                                  | :base-extension | org  | :exclude | hm-clod.org | :publishing-directory | /home/dk/Public/projects/936-harris-matrix/site/doc/ | :publishing-function                                                        | org-html-publish-to-html | :section-numbers       | nil | :table-of-contents | yes | :style | <link rel="stylesheet" |
